FKDD_COPY_DIFF_3_2026-02-14/Documents/Т_ПланыЗПРОП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Т_ПланыЗПРОП</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ТТ_ПланыЗПМенеджер</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Бренд</Name>
					<Type>
						<v8:Type>cfg:EnumRef.БрендыДляРасчетаЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штуки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШтукиП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кредиты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КредитыП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдельныйДоп</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдельныйДОПП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТрейдИн</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТрейдИнП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КАСКО</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КАСКОП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОСАГО</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОСАГОП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Маржа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаржаП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Неликвид</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеликвидП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>QVN</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>QVNП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоляАМ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоляАМП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДнейСклада</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Documents/Т_ПланыЗПРОП/Ext/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	//НаборЗаписей = РегистрыСведений.ТТ_План_TradeIn.СоздатьНаборЗаписей();
	//
	//НаборЗаписей.Отбор.Бренд.Установить(Бренд); 
	//НаборЗаписей.Отбор.Период.Установить(НачалоМесяца(Дата));

	//
	//Для Каждого Стр Из Сотрудники Цикл 
	//	
	//	НоваяЗапись = НаборЗаписей.Добавить(); 
	//	
	//	НоваяЗапись.Период = НачалоМесяца(Дата); 
	//	НоваяЗапись.Сотрудник = Стр.Сотрудник; 
	//	НоваяЗапись.Бренд = Бренд; 
	//	НоваяЗапись.ПланНовые = Стр.ПланНовые; 
	//	НоваяЗапись.ПланНовыеСумма = Стр.ПланНовыеСумма; 
	//	НоваяЗапись.План = Стр.ПланТрейдИн; 
	//	НоваяЗапись.ПланФинПродукт = Стр.ПланФин; 
	//	НоваяЗапись.ПланДоп = Стр.ПланДоп; 
	//	
	//	
	//КонецЦикла; 
	//
	//НаборЗаписей.Записать(Истина); 	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	НаборЗаписей = РегистрыСведений.ТТ_ПланыЗПМенеджер.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка); 
	
	Для каждого Стр из Сотрудники Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = НачалоМесяца(Дата); 
		НоваяЗапись.Бренд = Бренд; 
		НоваяЗапись.Сотрудник = Стр.Сотрудник; 
		НоваяЗапись.Параметр = Перечисления.ТТ_Параметры_ЗП.Штуки; 
		НоваяЗапись.План = Стр.Штуки; 
		НоваяЗапись.Процент = Стр.ШтукиП; 
		
		НаборЗаписей.Записать(Ложь); 	

		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = НачалоМесяца(Дата); 
		НоваяЗапись.Бренд = Бренд; 
		НоваяЗапись.Сотрудник = Стр.Сотрудник; 
		НоваяЗапись.Параметр = Перечисления.ТТ_Параметры_ЗП.Кредиты; 
		НоваяЗапись.План = Стр.Кредиты; 
		НоваяЗапись.Процент = Стр.КредитыП; 
		
		НаборЗаписей.Записать(Ложь); 	
		

		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = НачалоМесяца(Дата); 
		НоваяЗапись.Бренд = Бренд; 
		НоваяЗапись.Сотрудник = Стр.Сотрудник; 
		НоваяЗапись.Параметр = Перечисления.ТТ_Параметры_ЗП.УдельныйДОП; 
		НоваяЗапись.План = Стр.УдельныйДоп; 
		НоваяЗапись.Процент = Стр.УдельныйДОПП; 
		
		НаборЗаписей.Записать(Ложь); 
		
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = НачалоМесяца(Дата); 
		НоваяЗапись.Бренд = Бренд; 
		НоваяЗапись.Сотрудник = Стр.Сотрудник; 
		НоваяЗапись.Параметр = Перечисления.ТТ_Параметры_ЗП.TradeIn; 
		НоваяЗапись.План = Стр.ТрейдИн; 
		НоваяЗапись.Процент = Стр.ТрейдИнП; 
		
		НаборЗаписей.Записать(Ложь); 	

		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = НачалоМесяца(Дата); 
		НоваяЗапись.Бренд = Бренд; 
		НоваяЗапись.Сотрудник = Стр.Сотрудник; 
		НоваяЗапись.Параметр = Перечисления.ТТ_Параметры_ЗП.КАСКО; 
		НоваяЗапись.План = Стр.КАСКО; 
		НоваяЗапись.Процент = Стр.КАСКОП; 
		
		НаборЗаписей.Записать(Ложь); 	

		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = НачалоМесяца(Дата); 
		НоваяЗапись.Бренд = Бренд; 
		НоваяЗапись.Сотрудник = Стр.Сотрудник; 
		НоваяЗапись.Параметр = Перечисления.ТТ_Параметры_ЗП.Маржа; 
		НоваяЗапись.План = Стр.Маржа; 
		НоваяЗапись.Процент = Стр.МаржаП; 
		
		НаборЗаписей.Записать(Ложь);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = НачалоМесяца(Дата); 
		НоваяЗапись.Бренд = Бренд; 
		НоваяЗапись.Сотрудник = Стр.Сотрудник; 
		НоваяЗапись.Параметр = Перечисления.ТТ_Параметры_ЗП.ОСАГО; 
		НоваяЗапись.План = Стр.ОСАГО; 
		НоваяЗапись.Процент = Стр.ОСАГОП; 
		
		НаборЗаписей.Записать(Ложь); 	

		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = НачалоМесяца(Дата); 
		НоваяЗапись.Бренд = Бренд; 
		НоваяЗапись.Сотрудник = Стр.Сотрудник; 
		НоваяЗапись.Параметр = Перечисления.ТТ_Параметры_ЗП.Неликвид; 
		НоваяЗапись.План = Стр.Неликвид; 
		НоваяЗапись.Процент = Стр.НеликвидП; 
		
		НаборЗаписей.Записать(Ложь); 	
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = НачалоМесяца(Дата); 
		НоваяЗапись.Бренд = Бренд; 
		НоваяЗапись.Сотрудник = Стр.Сотрудник; 
		НоваяЗапись.Параметр = Перечисления.ТТ_Параметры_ЗП.QVN; 
		НоваяЗапись.План = Стр.QVN; 
		НоваяЗапись.Процент = Стр.QVNП; 
		
		НаборЗаписей.Записать(Ложь); 	
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = НачалоМесяца(Дата); 
		НоваяЗапись.Бренд = Бренд; 
		НоваяЗапись.Сотрудник = Стр.Сотрудник; 
		НоваяЗапись.Параметр = Перечисления.ТТ_Параметры_ЗП.Склад; 
		НоваяЗапись.План = Стр.ДоляАМ; 
		НоваяЗапись.Процент = Стр.ДоляАМП; 
		
				
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = НачалоМесяца(Дата); 
		НоваяЗапись.Бренд = Бренд; 
		НоваяЗапись.Сотрудник = Стр.Сотрудник; 
		НоваяЗапись.Параметр = Перечисления.ТТ_Параметры_ЗП.ДнейСклада; 
		НоваяЗапись.План = Стр.ДнейСклада; 
		
		НаборЗаписей.Записать(Ложь); 	
		

		
		
		НаборЗаписей.Записать(Ложь); 	
		
		
		
	КонецЦикла;
КонецПроцедуры
